Repository: AlaaGitHub2020/tweets_emoji_example
Catalog: lib/l10n/intl_*.arb
Languages: ru

# genericError
source: Error Happened
ru: Произошла ошибка

# unexpected
source: Unexpected Error Happened
ru: Произошла непредвиденная ошибка

source: PlatForm Server Failure
ru: Сбой сервера платформы

source: PlatForm SQL Database Failure
ru: Сбой базы данных платформы SQL

source: unable To Update
ru: невозможно обновить

source: Edit Tweet
ru: Редактировать твит

source: Create A New Tweet
ru: Создать новый твит

source: Saving
ru: Сохранение

# canNotBbeEmpty
source: can't be empty
ru: не может быть пустым

source: exceeding length, max:
ru: превышение длины, не более:

source: Type a new Tweet
ru: Введите новый твит

source: Add An Emoji
ru: Добавить смайлик

source: Remove The Emoji
ru: Удалить эмодзи

source: Try with firebase
ru: Попробуйте с firebase

source: Try with SQL lite
ru: Попробуйте с SQLite

source: Tweets Emoji With Firebase
ru: Твиты Emoji с Firebase

source: Tweets Emoji With SQL Lite
ru: Твиты Emoji с SQLite

source: add new tweet
ru: добавить новый твит

source: We Have an Error
ru: У нас есть ошибка

# theSizeOfDatabase
source: The Size of database is :
ru: Размер базы данных:

source: No Recent
ru: Нет недавних

source: No data in the DB
ru: Нет данных в БД

source: Loading...
ru: Загрузка...
